//todo: КУРСОВАЯ РАБОТА (HTML/JS)

В курсовой работе должно присутствовать две страницы: 
1. Каталог товаров
2. Корзина товаров

Каталог товаров должен быть сверстан на tailwind либо использован типовой шаблон.
Макет каталога может быть любым: в одну, две или три колонки.
В каталоге должна присутствовать: картинка, название товара, описание, цена, скидка.
Каталог должен динамически формироваться из модели данных.
При формировании страниц должен использоваться шаблонизатор handlebars.

На страницы корзины должен выводиться список выбранных товаров, изменяться их количество, пересчитываться общая сумма с учетом скидки,
удаляться ненужная позиция. При нажатии кнопки "Оформить" должно появляться диалоговое окно с информацией что заказ оформлен и генерироваться номер заказа. 

Сценарий работы.
При нажатии на кнопку "Добавить в корзину" изменяется индикатор корзины на зеленый и показывается кол-во товаров. При нажании на индикатор
корзины осуществляется переход на страницу корзины. Со страницы корзины должен быть предусмострен переход на страницу каталога. 
